{
    "pt": {
        "Faça o teste e receba ofertas das melhores empresas de tecnologia":"Faça o teste e receba ofertas das melhores empresas de tecnologia",
        "Por que ":"Por que ",
        "No lugar de entender as particularidades de cada processo seletivo você pode fazer um só teste que abre as portas!":"No lugar de entender as particularidades de cada processo seletivo você pode fazer um só teste que abre as portas!",
        "Teste que reflete as expectativas da industria":"Teste que reflete as expectativas da industria",
        "Resultados que te direcionam a ser o melhor profissional":"Resultados que te direcionam a ser o melhor profissional",
        "Acesso direto ao emprego dos sonhos":"Acesso direto ao emprego dos sonhos",
        "Perguntas frequentes":"Perguntas frequentes",
        "Quanto custa pra participar?":"Quanto custa pra participar?",
        "De graça para desenvolvedores. As empresas pagam pra ter acesso ao seu perfil.":"De graça para desenvolvedores. As empresas pagam pra ter acesso ao seu perfil.",
        "Saiba mais":"Saiba mais",
        "A participação é confidencial?":"A participação é confidencial?",
        "Sim, só mostramos o seu perfil pra empresa quando você estiver pronto. E mesmo nesse momento você pode escolher esconder seu perfil de certas empresas.":"Sim, só mostramos o seu perfil pra empresa quando você estiver pronto. E mesmo nesse momento você pode escolher esconder seu perfil de certas empresas.",
        "Leia o FAQ":"Leia o FAQ",
        "Quer se preparar primeiro?":"Quer se preparar primeiro?",
        "Veja esses artigos que separamos:":"Veja esses artigos que separamos:",
        "Estruturas de dados":"Estruturas de dados",
        "Quase todos os problemas em entrevistas requerem que o candidato demonstre um conhecimento avançado em estruturas de dados.":"Quase todos os problemas em entrevistas requerem que o candidato demonstre um conhecimento avançado em estruturas de dados.",
        "Resolução de problemas":"Resolução de problemas",
        "Resolver problemas é uma das habilidades chave pra ser um desenvolvedor de software de sucesso":"Resolver problemas é uma das habilidades chave pra ser um desenvolvedor de software de sucesso",
        "Design de sistemas":"Design de sistemas",
        "Entender todas as camadas envolvidas em projetar grandes sistemas pode fazer uma grande diferença na sua oferta de emprego":"Entender todas as camadas envolvidas em projetar grandes sistemas pode fazer uma grande diferença na sua oferta de emprego",
        "Quer falar com a gente?":"Quer falar com a gente?",
        "Seu feedback é muito importante pra nós.":"Seu feedback é muito importante pra nós.",
        "Enviar Mensagem":"Enviar Mensagem",
        "Faça o teste":"Faça o teste",
        "Você tem 3 tentativas pra passar: faça agora pra ver como se sai!":"Você tem 3 tentativas pra passar: faça agora pra ver como se sai!",
        "Nosso teste mede a capacidade dos desenvolvedores em resolução de problemas e arquitetura de sistemas":"Nosso teste mede a capacidade dos desenvolvedores em resolução de problemas e arquitetura de sistemas",
        "Veja o seu reporte":"Veja o seu reporte",
        "Te falamos no que você foi bem, o que você pode melhorar e como você pode melhorar":"Te falamos no que você foi bem, o que você pode melhorar e como você pode melhorar",
        "No seu tempo":"No seu tempo",
        "Quando você quiser, mostramos seu perfil pra nossas empresas parceiras e suas entrevistas começam":"Quando você quiser, mostramos seu perfil pra nossas empresas parceiras e suas entrevistas começam",
        "Logue em nosso site com o google": "Logue em nosso site com o google",
        "Eu concordo com os": "Eu concordo com os",
        "Termos de serviço": "Termos de serviço",
        "e a": "e a",
        "Politica de Privacidade": "Politica de Privacidade",
        "Que bacana que deseja fazer nosso teste!": "Que bacana que deseja fazer nosso teste!",
        "As questões são no formato de múltipla escolha. Tente responder essa questão de teste sem compromisso :)": "As questões são no formato de múltipla escolha. Tente responder essa questão de teste sem compromisso :)",
        "Vamos entrar em contato em uma dessas plataformas.": "Vamos entrar em contato em uma dessas plataformas.",
        "Nos siga nas redes sociais!": "Nos siga nas redes sociais!",
        "Qual das seguintes requisições HTTP não deveria alterar o estado do servidor?": "Which of the following HTTP requests should not change the state of the server?",
        "A questão abaixo não é uma questão de verdade do teste. Serve somente pare que você tenha um exemplo do que esperar durante o teste real.":"The question bellow is not a real quiz question. It is only here to show you one exemple of what to expect of the real quiz when you get to it.",
        "Durante o teste você encontrar questões dos seguintes tipos: Questões de completar linhas de código, Desenvolvimento web backend, Algoritmos, Low-level systems, System design e infraestrutura. Não esperamos que saibam todos esses tópicos em detalhe, então é natural não acertar algumas das questões.":"During the quiz you are going to find questions of the following type: Questions that will ask will to fill in lines of code, Backend web development, Algorithms, Low-level systems, System design and infrastructure. We do not expect quiz takers to know everything about all these topics, so it is natural to miss some of the right answers.",
        "Você terá somente 2 minutos para cada questão. Observe o temporizador com o tempo máximo de cada questão e tente otimizar o seu tempo.":"You only have 2 minutes to answer each of the questions. Observe the timer with the available time and try to optimize for quick responses.",
        "Ao se registrar o teste já vai começar!!":"With your registration the test will start right away!!",
        "Vou me registrar para o teste!":"I am goint to register to take the test!"
    },
    "en":{
        "Faça o teste e receba ofertas das melhores empresas de tecnologia":"Take the test and get offers from the best tech companies",
        "Por que ":"Why ",
        "No lugar de entender as particularidades de cada processo seletivo você pode fazer um só teste que abre as portas!":"Instead of trying to understand the peculiarities of each selection process, you can take a single test that opens the doors for you!",
        "Teste que reflete as expectativas da industria":"A test that reflects the industry expectations",
        "Resultados que te direcionam a ser o melhor profissional":"Results that guide you to be a better professional",
        "Acesso direto ao emprego dos sonhos":"Direct access to your dream job",
        "Perguntas frequentes":"FAQ",
        "Quanto custa pra participar?":"How much do I have to pay to take the test?",
        "De graça para desenvolvedores. As empresas pagam pra ter acesso ao seu perfil.":"It's free for developers. Companies will have to pay to get access to your profile.",
        "Saiba mais":"Learn more",
        "A participação é confidencial?":"Is my data confidential?",
        "Sim, só mostramos o seu perfil pra empresa quando você estiver pronto. E mesmo nesse momento você pode escolher esconder seu perfil de certas empresas.":"Yes, we will only show your profile to companies when you are ready for it. Even when this is the case, you can choose to hide your profile for certain comapnies.",
        "Leia o FAQ":"Read the FAQ",
        "Quer se preparar primeiro?":"Want to prepare yourself first?",
        "Veja esses artigos que separamos:":"Check out this articles that we selected for you:",
        "Estruturas de dados":"Data structures",
        "Quase todos os problemas em entrevistas requerem que o candidato demonstre um conhecimento avançado em estruturas de dados.":"Almost all interview problems require the developer to demonstrate advanced knowledge of data structures.",
        "Resolução de problemas":"Problem solving",
        "Resolver problemas é uma das habilidades chave pra ser um desenvolvedor de software de sucesso":"Problem solving is one of the key skills to land a successful software developer position",
        "Design de sistemas":"System design",
        "Entender todas as camadas envolvidas em projetar grandes sistemas pode fazer uma grande diferença na sua oferta de emprego":"Understanding all the layers involved in designing large systems can make a big difference in your job offer",
        "Quer falar com a gente?":"Want to talk to us?",
        "Seu feedback é muito importante pra nós.":"Your feedback is very important.",
        "Enviar Mensagem":"Send message",
        "Faça o teste":"Take the test",
        "Você tem 3 tentativas pra passar: faça agora pra ver como se sai!":"You get 3 attempts: take the test now to see how you perform!",
        "Nosso teste mede a capacidade dos desenvolvedores em resolução de problemas e arquitetura de sistemas":"Our test evaluates developers problem solving skills and systems architecture",
        "Veja o seu reporte":"Check your performance report",
        "Te falamos no que você foi bem, o que você pode melhorar e como você pode melhorar":"We are going to tell you in which of the subjects you went well, which ones need improvement, and how to improve",
        "No seu tempo":"In your time",
        "Quando você quiser, mostramos seu perfil pra nossas empresas parceiras e suas entrevistas começam":"You choose when to show your profile to our partner companies and then your interviews start",
        "Logue em nosso site com o google": "Login into our website using google",
        "Eu concordo com os": "I agree with the",
        "Termos de serviço": "Service Terms",
        "e a": "and the",
        "Politica de Privacidade": "Privacy Policy",
        "Que bacana que deseja fazer nosso teste!": "It is so nice that you want to take our test!",
        "As questões são no formato de múltipla escolha. Tente responder essa questão de teste sem compromisso :)": "The quiz questions are shown in a multiple choice format. Try to answer this question with nothing to lose!",
        "Praticando sem compromisso": "Practicing without compromise",
        "Considerando notação Big-O para complexidade de pior caso de um algoritmo, qual opção abaixo entrega melhor performance para uma quantidade elevada de elementos de entrada?": "Considering Big-O notation for the worst case complexity of an algorithm, choose the option below that delivers the best performance for a big number of input elements.",
        "Eu não sei": "I don't know",
        "Confirme a resposta": "commit to this answer",
        "Questão": "Question",
        "Não sei.": "I don't know.",
        "Ou use seu email e uma senha para continuarmos": "Or you can use your email and password to continue",
        "Vamos entrar em contato em uma dessas plataformas.": "Lets get in touch in these platforms",
        "Nos siga nas redes sociais!": "Follow us in social media!",
        "Entre com": "Enter with",
        "Entre com Google": "Enter with Google",
        "O assunto no qual conseguiu ir melhor foi": "Your best subject was",
        "e o assunto no qual precisa melhorar foi": "and the subject that needs improvement is",
        "O teste cobre uma gama de assuntos, de maneira geral, focados em desenvolvimento de aplicações e fundamentos de Ciência da Computação. Esses são os requisitos principais na maioria das grandes empresas de tecnologia. Seu melhor resultado foi em":"The test covers a range of subjects mostly focused in general application development and computer science fundamentals, which are the main requirements in most top tech companies interviews. When you took it, you demonstrated particular strength in",
        "Se você deseja aprimorar sua performance para próximas entrevistas, nós recomendamos começar com":"If you want to improve your performance in upcoming interviews, we recommend starting with",
        "Abaixo você pode encontrar um relatório detalhado de sua performance:":"Below you have a more detailed report of your performance:",
        " - Nós podemos aprimorar esse assunto":" - We can improve on this topic",
        " - Você está num bom caminho, é hora de se tornar ótimo!":" - You're in a good track, time to become great!",
        " - Mantenha o bom resultado desse assunto":" - Just keep up the good results on this topic",
        "Teste em construção, estará disponível em breve.":"Test under construction, it will be available soon."
    }
}